incompressible/simpleFoam/Ahmed-Body-25degree/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (40 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (40 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (40 0 0);
        value           uniform (40 0 0);
    }
    
    symmetry
    {
        type           symmetry;
    }
    
    slipWalls
    {
        type            slip;
    }

    wallAhmed
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    wallGround
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
