incompressible/simpleFoam/Ahmed-Body-25degree/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }
    
    symmetry
    {
        type           symmetry;
    }

    slipWalls
    {
        type            slip;
    }

    wallAhmed
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    
    wallGround
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
