incompressible/simpleFoam/Ahmed-Body-25degree/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 10;

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          uniform 10;
    }
    outlet
    {
       type            inletOutlet;
       inletValue      uniform 10;
       value           uniform 10;
    }
    
    symmetry
    {
        type           symmetry;
    }
    
    slipWalls
    {
        type            slip;
    }
    
    wallAhmed
    {
        type           omegaWallFunction;
        value          uniform 10;
    }
    
    wallGround
    {
        type           omegaWallFunction;
        value          uniform 10;
    }
}


// ************************************************************************* //
