incompressible/simpleFoam/Ahmed-Body-25degree/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
 FoamFile 
{
    version         2.0; 
    format          ascii; 
    class           dictionary;
    object          decomposeParDict;
} 

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
numberOfSubdomains 3; 
//method             hierarchical; 
method              scotch;

hierarchicalCoeffs
{
    n               (3 1 1);
    delta           0.001;
    order           xyz;
} 
// ************************************************************************* //
